package msg

var messBytes = [][]byte{
	{
		0x01,       // заголовок
		0x20, 0x00, //длина пакета = 32 байта, старший бит сброшен - неотправленных данных -нет
		0x01, // Тэг = тип устройства
		0x9A, // тип устройства
		0x02, // Тэг = версия
		0x18, // fw version = 24
		0x03, // Тэг = IMEI
		// IMEI = 861230043907626
		0x38, 0x36, 0x31, 0x32, 0x33, 0x30, 0x30, 0x34, 0x33, 0x39, 0x30, 0x37, 0x36, 0x32, 0x36,
		0x04,       // Тэг = номер устройства
		0x32, 0x00, // device id = 50
		0xFE,       // Тэг = расширенные теги существуют
		0x06, 0x00, // длина расширенных тегов - 6 байт
		0x01, 0x00, // Расширенный тег = 1
		0x00, 0x00, 0x00, 0x00, // Данные расширенного тега №1
		0x8F, 0x29, // CRC
	},
	// {
	// 	0x01,       // заголовок
	// 	0x20, 0x00, //длина пакета = 32 байта, старший бит сброшен - неотправленных данных -нет
	// 	0x01, // Тэг = тип устройства
	// 	0x9A, // тип устройства
	// 	0x02, // Тэг = версия
	// 	0x18, // fw version = 24
	// 	0x03, // Тэг = IMEI
	// 	// IMEI = 861230043907627
	// 	0x38, 0x36, 0x31, 0x32, 0x33, 0x30, 0x30, 0x34, 0x33, 0x39, 0x30, 0x37, 0x36, 0x32, 0x37,
	// 	0x04,       // Тэг = номер устройства
	// 	0x33, 0x00, // device id = 51
	// 	0xFE,       // Тэг = расширенные теги существуют
	// 	0x06, 0x00, // длина расширенных тегов - 6 байт
	// 	0x01, 0x00, // Расширенный тег = 1
	// 	0x00, 0x00, 0x00, 0x00, // Данные расширенного тега №1
	// 	0x89, 0x54, // CRC
	// },
	// {
	// 	0x08,       // заголовок
	// 	0x15, 0x00, // длина пакета 0х0015 = 21 байт
	// 	0x82,       // число тегов с маской 0x80 = 2 тега
	// 	0x04,       //тег 04 – номер прибора
	// 	0xFE,       // тег FE – есть расширенные теги
	// 	0x02, 0x00, // число расширенных тегов 0x0002 = 2 расширенных тега
	// 	0x01, 0x00, //расширенный тег 0001
	// 	0xFA, 0x00, //расширенный тег 00FA
	// 	0x32, 0x00, //данные тега 04 0x0032 = 50
	// 	0x08, 0x00, // длина данных расширенных тегов 0x0008 = 8 байт
	// 	0x00, 0x00, 0x00, 0x00, // значение расширенного тега 0001
	// 	0x00, 0x00, 0x00, 0x00, //значение расширенного тега 00FA
	// 	0x59, 0x93, //CRC
	// },
}

func GetMsgs() [][]byte {
	return messBytes
}
